# !/usr/bin/env python
# coding= utf-8

def fn_1():
    """__~ 按位取反__"""
    print(~1)
    #   码 0001 == 1
    # 补码 1110
    # 反码 1101 = 1110 - 1
    # 取反 1010 == -2

    print(~-2)
    #   码 1010 == -2
    # 补码[反码] 0101
    # 反码[补码] 0110 = 0101 + 1
    # 取反 0001 == 1

    print(~4)
    #   码 0100 == 4
    # 补码 1011
    # 反码 1010 = 1011 -1
    # 取反 1101 == -5

    print(~12)
    #   码 01100 == 12
    # 补码 10011
    # 反码 10010 = 10011 - 1
    # 取反 11101 == -13

    print(~-12)
    #   码 11100 == -12
    # 补码 00011
    # 反码 00100 = 00011 + 1
    # 取反 01011 == 11

    """小结
    【按位取反】运算，等价于一个数的相反数减去 1
    a>0, ~a == -a - 1
    a<0, ~a == a - 1
    """


def fn_2():
    """_<< 左移_
    """
def fn_3():
    """_>> 右移_
    """

def fn_4():
    """_& 按位与_
    """

def fn_5():
    """_^ 按位异或_
    """

def fn_6():
    """_| 按位或_
    """


if __name__=='__main__':
    fn_1()

